In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
s = pd.Series([1,3,5,np.NaN,9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    9.0
dtype: float64

In [7]:
df = pd.DataFrame(s)
df

     0
0  1.0
1  3.0
2  5.0
3  NaN
4  9.0

In [9]:
dates = pd.date_range("20180609",periods=6)
dates

DatetimeIndex(['2018-06-09', '2018-06-10', '2018-06-11', '2018-06-12',
               '2018-06-13', '2018-06-14'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(data=np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2018-06-09  2.367432 -0.130602  1.386017 -0.240016
2018-06-10 -1.230562  1.152585  1.269892  0.854046
2018-06-11 -0.533663 -0.051385 -0.779114  1.840978
2018-06-12 -0.160635 -1.276207 -0.710941 -0.560604
2018-06-13 -0.885541  1.336872 -1.380985 -0.209101
2018-06-14 -0.009375  0.399078  0.550975  2.230759

In [18]:
dictionnary = {'A':np.random.randn(4),
              'B':['manger','boire','dormir','manger'],
              'C':pd.date_range('20100103',periods=4)}
df = pd.DataFrame(dictionnary)
df

          A       B          C
0  0.704645  manger 2010-01-03
1 -3.161102   boire 2010-01-04
2 -2.023622  dormir 2010-01-05
3 -0.931511  manger 2010-01-06

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [22]:
df.values

array([[0.7046448638850529, 'manger', Timestamp('2010-01-03 00:00:00')],
       [-3.1611015146518096, 'boire', Timestamp('2010-01-04 00:00:00')],
       [-2.0236218644541646, 'dormir', Timestamp('2010-01-05 00:00:00')],
       [-0.9315108332742857, 'manger', Timestamp('2010-01-06 00:00:00')]], dtype=object)

In [27]:
df.sort_index(axis=1,ascending=False)

           C       B         A
0 2010-01-03  manger  0.704645
1 2010-01-04   boire -3.161102
2 2010-01-05  dormir -2.023622
3 2010-01-06  manger -0.931511

In [32]:
df.sort_values('C',ascending=False)

          A       B          C
3 -0.931511  manger 2010-01-06
2 -2.023622  dormir 2010-01-05
1 -3.161102   boire 2010-01-04
0  0.704645  manger 2010-01-03

In [46]:
df.loc[:2,['B','C']]

        B          C
0  manger 2010-01-03
1   boire 2010-01-04
2  dormir 2010-01-05

In [48]:
df.iloc[3]

A              -0.931511
B                 manger
C    2010-01-06 00:00:00
Name: 3, dtype: object